tom38121605/RD_02_mcu_STM32_txt/STM32_01_H7A3_F429_VSCODE/_Awork52_STMH7A3_txt/AUDIO-H7A3RI-AudioTX_09_bf_chgmain_k/Src/AppConfig/AUDIO-H7A3RI/FreeRTOS/config.c
/**
 * @file      config.c
 *
 * @brief     Supports NVM and bss configuration sections:
 *            FConfig : section in NVM, where current parameters are saved and this is re-writabele.
 *            bssConfig : section in RAM, which is representing FConfig.
 *
 *            Application on startup shall load_bssConfig() : this will copy FConfig -> bssConfig
 *            Accessing to variables is by pointer get_pbssConfig();
 *
 *            If application wants to re-write FConfig, use save_bssConfig(*newRamParametersBlock);
 *
 *
 *            NOTE: The code is very MCU dependent and save will work with STM32H7 only
 *
 *            Linker script shall define flash sector1 ADDR_FLASH_SECTOR_1 as sections
 *
 *            ".fconfig"         @0x08004000
 *
 * @author    Decawave Applications
 *
 * @attention Copyright (c) 2021 - 2022, Qorvo US, Inc.
 * All rights reserved
 * Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright notice, this
 *  list of conditions, and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *  this list of conditions and the following disclaimer in the documentation
 *  and/or other materials provided with the distribution.
 * 3. You may only use this software, with or without any modification, with an
 *  integrated circuit developed by Qorvo US, Inc. or any of its affiliates
 *  (collectively, "Qorvo"), or any module that contains such integrated circuit.
 * 4. You may not reverse engineer, disassemble, decompile, decode, adapt, or
 *  otherwise attempt to derive or gain access to the source code to any software
 *  distributed under this license in binary or object code form, in whole or in
 *  part.
 * 5. You may not use any Qorvo name, trademarks, service marks, trade dress,
 *  logos, trade names, or other symbols or insignia identifying the source of
 *  Qorvo's products or services, or the names of any of Qorvo's developers to
 *  endorse or promote products derived from this software without specific prior
 *  written permission from Qorvo US, Inc. You must not call products derived from
 *  this software "Qorvo", you must not have "Qorvo" appear in their name, without
 *  the prior permission from Qorvo US, Inc.
 * 6. Qorvo may publish revised or new version of this license from time to time.
 *  No one other than Qorvo US, Inc. has the right to modify the terms applicable
 *  to the software provided under this license.
 * THIS SOFTWARE IS PROVIDED BY QORVO US, INC. "AS IS" AND ANY EXPRESS OR IMPLIED
 *  WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 *  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. NEITHER
 *  QORVO, NOR ANY PERSON ASSOCIATED WITH QORVO MAKES ANY WARRANTY OR
 *  REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, OR
 *  ACCURACY OF THE SOFTWARE, THAT IT IS ERROR FREE OR THAT ANY DEFECTS WILL BE
 *  CORRECTED, OR THAT THE SOFTWARE WILL OTHERWISE MEET YOUR NEEDS OR EXPECTATIONS.
 * IN NO EVENT SHALL QORVO OR ANYBODY ASSOCIATED WITH QORVO BE LIABLE FOR ANY
 *  DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 *  (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 *  LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 *  ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 *  SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 *
 */

#include <stdint.h>
#include <string.h>
#include <stm32h7xx.h>

#include "deca_device_api.h"
#include "rtls_version.h"
#include "appConfig.h"
#include "main.h"
#include "crc16.h"

extern int flash_app_erase(eFlashErase_e status);
//------------------------------------------------------------------------------

/* MACRO for WRITE
 *
 * NOTE: The code is very MCU dependent and save will work with STM32H7 only
 *
 * Linker script shall define flash sector1 as sections
 *
 * ".fconfig"         @0x08004000
 *
 * */

#define ADDR_FLASH_PAGE_2    ((uint32_t)0x08001000UL)

/*
 * (re-writable block) @ of sector 1
 *
 * must correspond to .fconfig section
 * */

#define FCONFIG_PAGES_TO_BE_PROTECTED     (OB_WRP_SECTOR_0TO3)
///*(OB_WRP_PAGES2TO3)*/

//------------------------------------------------------------------------------
extern uint8_t __config_entry_start[];
extern uint8_t __config_entry_end[];

extern uint8_t __fconfig_start[];
extern uint8_t __fconfig_end[];

extern uint8_t __rconfig_start[];
extern uint8_t __rconfig_end[];
extern uint8_t __rconfig_crc_end[];

__attribute__((section(".rconfig_crc"))) static uint16_t config_crc = 0;
__attribute__((section(".fconfig"))) const uint32_t DummyConfig[1]  = {0xDEADBEEF};

static bool auto_restore = false;

//------------------------------------------------------------------------------
// Implementation


/* @fn      load_bssConfig
 * @brief   copy parameters from NVM to RAM structure.
 *
 *          assumes that memory model in the MCU of .text and .bss are the same
 * */
void load_bssConfig(bool initStatus)
{
    uint16_t rconfig_len =  (uint16_t)((uint8_t*)&__rconfig_end - (uint8_t*)&__rconfig_start);
    uint16_t rconfig_len_with_crc =  (uint16_t)((uint8_t*)&__rconfig_crc_end - (uint8_t*)&__rconfig_start);    
    
    memcpy((uint8_t*)&__rconfig_start, (uint8_t*)&__fconfig_start, rconfig_len_with_crc);
    uint16_t crc = calc_crc16((uint8_t*)&__rconfig_start, rconfig_len);
    if(crc != config_crc)
    {
        auto_restore = true;
        restore_bssConfig(initStatus);
    }
}

/* @fn      restore_bssConfig
 * @brief   copy parameters from default NVM section to RAM structure.
 *
 *          assumes that memory model in the MCU of .text and .bss are the same
 * */
void restore_bssConfig(bool initStatus)
{
    //Copy default to RAM
    for(uint32_t *ptr = (uint32_t*)&__config_entry_start ; ptr < (uint32_t*)&__config_entry_end ; ptr++)
    {
        void (*restore)(void) = (void(*)(void))(*ptr);
        restore();
    }
    save_bssConfig();
}


/* @brief    save pNewRamParametersBlock to FConfig
 * @return  _NO_ERR for success and error_e code otherwise
 * */
error_e save_bssConfig(void)
{
#ifdef STM32H7
    FLASH_OBProgramInitTypeDef     OptionsBytesStruct;
    OptionsBytesStruct.Banks = FLASH_BANK_1;
    
    uint16_t rconfig_len_with_crc =  (uint16_t)((uint8_t*)&__rconfig_crc_end - (uint8_t*)&__rconfig_start);
    uint16_t rconfig_len =  (uint16_t)((uint8_t*)&__rconfig_end - (uint8_t*)&__rconfig_start);
    uint32_t ram_read_address = (uint32_t) __rconfig_start;
    config_crc = calc_crc16((uint8_t*)&__rconfig_start, rconfig_len);


    HAL_FLASH_Unlock();            /**< Unlock the Flash to enable the flash control register access */

    HAL_FLASH_OB_Unlock();        /**< Unlock the Options Bytes */

    HAL_FLASHEx_OBGetConfig(&OptionsBytesStruct);        /**< Get pages write protection status */

    HAL_FLASH_OB_Lock();    /**< Lock the Options Bytes */

    /* The selected pages are not write protected */
    if (OptionsBytesStruct.WRPState == OB_WRPSTATE_DISABLE
    || (OptionsBytesStruct.WRPSector/*WRPPage*/ & FCONFIG_PAGES_TO_BE_PROTECTED) != 0x00)
    {

        /* FLASH the FCONFIG */
        flash_app_erase(Config_Erase);

        uint32_t flash_write_address = (uint32_t)__fconfig_start;

        while (flash_write_address < (uint32_t)__fconfig_start + (uint32_t)rconfig_len_with_crc)
        {
            if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD, flash_write_address, ram_read_address) == HAL_OK)
            {
                flash_write_address += 4*4;
                ram_read_address += 4*4;
            }
            else
            {
              return(_ERR_Flash_Error);    /**< Error occurred while writing data in Flash memory */
            }
        }

    }

    HAL_FLASH_Lock();    /**< Lock the Flash to disable the flash control register access */
#endif
    return HAL_FLASH_GetError();
}

bool is_auto_restore_bssConfig(void)
{
    return auto_restore;
}

void clear_auto_restore_bssConfig(void)
{
    auto_restore = false;
}

/* @fn      update_bssConfig
 * @brief   update parameters from RAM section.
 *
 *          assumes that memory model in the MCU of .text and .bss are the same
 * */
void update_bssConfig(void)
{
    // nothing to do for this target
}
